caoyue0115/2026-9-1_yuyin_lingnabeier/esp_idf_demo/sdkconfig.defaults.vocat_lowcost_16m8m
# ESP-VoCat v1.2 compatible low-cost profile: 16MB Flash + 8MB Octal PSRAM.
# Use explicitly via:
#   SDKCONFIG_DEFAULTS="sdkconfig.defaults;sdkconfig.defaults.vocat_lowcost_16m8m"
#
# This file must not change OTA release gates or embed runtime secrets.

CONFIG_IDF_TARGET="esp32s3"

# Keep the v5/v6 default 16MB flash geometry for the first low-cost stage.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

# Keep the existing default partition table in stage 1.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# Target board has 8MB Octal PSRAM; keep type auto so boot probes the real
# density.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768

# Keep behavior deterministic across local sdkconfig states.
CONFIG_FREERTOS_TASK_CREATE_ALLOW_EXT_MEM=y
CONFIG_SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY=y

CONFIG_COMPILER_OPTIMIZATION_PERF=y
